html/2020-02-14--mirage-compilation-next.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://blog.x25519.net/rss.xml"
      title="RSS feed for https://blog.x25519.net/"/>
<title>MirageOS compilation</title>
<meta  name="author" content="dinosaure" />
<link href= "static/style.css" rel="stylesheet" type="text/css" />
<meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8" />
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1"></head>
<body>
<div id="preamble" class="status">
<div class="header">
  <a href="https://blog.x25519.net">dinosaure's Blog</a>
</div></div>
<div id="content">
<div class="headline"> <h1 class="post-title"><a href="2020-02-14--mirage-compilation-next.html">MirageOS compilation</a></h1>
</div><div class="post-date"><2020-02-14></div><p>
Into my previous article, I just showed up some internals about the MirageOS
compilation. However, the story is a bit complex. This article wants to go
further and it will describe much more details.
</p>

<div id="outline-container-org3a95305" class="outline-2">
<h2 id="org3a95305">A story about targets</h2>
<div class="outline-text-2" id="text-org3a95305">
<p>
MirageOS can compile an <i>unikernel</i> to 3 targets:
</p>
<ul class="org-ul">
<li>the UNIX target</li>
<li>the Solo5 target</li>
<li>the Xen target</li>
</ul>

<p>
For each, we need to a special link step to produce the right ELF file.
</p>
</div>
</div>
</div>
<div id="postamble" class="status"><div id="archive">
  <a href="archive.html">archive</a>
</div></div>
</body>
</html>
